podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Internal.save/peripherals/SIM_MKE04Z8M4.svd.xml
            <register>
               <name>UUIDMH</name>
               <description>Universally Unique Identifier Middle High Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-write</access>
            </register>
            <register>
               <name>CLKDIV</name>
               <description>BUS Clock Divider Register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>OUTDIV3</name>
                     <description>Clock 3 output divider value\n
This field sets the divide value for the timers(FTM0, FTM2,PWT)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ICSOUTCLK</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ICSOUTCLK/2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTDIV2</name>
                     <description>Clock 2 output divider value\n
This field sets the divide value for the bus/FLASH, follows OUTDIV1</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not divided from divider1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Divide by 2 from divider1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUTDIV1</name>
                     <description>Clock 1 output divider value\n
This field sets the divide value for the core/system clock</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>ICSOUTCLK</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>ICSOUTCLK/2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>ICSOUTCLK/3</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>ICSOUTCLK/4</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
